app/Http/Controllers/BidsController.php

    public function createBid(Buyers $buyers)
    {
      $bid = new Bids;
      $bid->quantity = 10;
      $bid->user_id = auth()->id();
      $bid->demands_id = $buyers->id;
      $bid->save();
---
insert into `bids` (`quantity`, `user_id`, `demands_id`, `updated_at`, `created_at`) values ('10', '2', '66', '2017-09-01 03:18:27', '2017-09-01 03:18:27')