app/Http/Controllers/BuyersController.php

select * from `demands` where `demands`.`id` = 'create' limit 1
---
    public function edit($id)
    {
        $demands = Buyers::findorFail($id);
        return view('Buyers.edit')->with('demands', $demands);