app/Http/Controllers/BuyersController.php

    public function index()
    {
        $demands = Buyers::orderBy('id', 'desc')->paginate(5);;
        return view('Buyers.index')->with('demands',$demands);
---
select * from `demands` order by `id` desc limit 5 offset 0

    public function store(Request $request)
    {
        $input = Input::all();
        $demands = new Buyers;
        //$bid->user_id = Input::get('userId');
        $demands->crop_type = Input::get('crop_type');
        $demands->order_quantity = Input::get('order_quantity');
        $demands->start_date_of_order = date('Y-m-d', strtotime(Input::get('start_date_of_order')));
        $demands->end_date_of_order = date('Y-m-d', strtotime(Input::get('end_date_of_order')));
        $demands->user_id = auth()->id();
        $demands->order_status = 'approved';
        $demands->save();
---
insert into `demands` (`crop_type`, `order_quantity`, `start_date_of_order`, `end_date_of_order`, `user_id`, `order_status`) values ('bora', '100', '2017-08-27', '2017-09-03', '3', 'approved')

    public function edit($id)
    {
        $demands = Buyers::findorFail($id);
        return view('Buyers.edit')->with('demands', $demands);
---
select * from `demands` where `demands`.`id` = '58' limit 1

    public function destroy($id)
    {
        $demands = Buyers::find($id);
        $demands->delete();
---
delete from `demands` where `id` = '1'