app/Http/Controllers/CommentsController.php

insert into `comments` (`body`, `user_id`, `buyers_id`, `updated_at`, `created_at`) values ('Wtf', '2', '66', '2017-09-01 16:15:44', '2017-09-01 16:15:44')
---
    public function create_comment(Buyers $buyers)
    {

        Comments::create([
            'body' => request('body'),
            'user_id' => auth()->id(),
            'buyers_id' => $buyers->id
        ]);