app/Http/Controllers/FarmersController.php

    public function store(Request $request)
    {
      $input = Input::all();
      $inStocks = new Farmers;
      //$bid->user_id = Input::get('userId');
      $inStocks->crop_name = Input::get('crop_name');
      $inStocks->crop_quantity = Input::get('crop_quantity');
      $inStocks->crop_cost_per_lb = Input::get('crop_cost_per_lb');
      $inStocks->crop_produce_date = date('Y-m-d', strtotime(Input::get('crop_produce_date')));
      $inStocks->crop_estimate_reap_date = date('Y-m-d', strtotime(Input::get('crop_estimate_reap_date')));
      $inStocks->save();
---
insert into `crops` (`crop_name`, `crop_quantity`, `crop_cost_per_lb`, `crop_produce_date`, `crop_estimate_reap_date`) values ('Some Scunt', '100', '300', '2017-08-31', '2017-09-01')